{"pages":[{"url":"pages/about.html","text":"About Currently PhD Fellow at Danish Meat Research Institute - Teknologisk Institut","tags":"pages","title":"About"},{"url":"pages/calendar.html","text":"","tags":"pages","title":"Calendar"},{"url":"project_management.html","text":"DMRI work structure I have attempted to structure the work for the next 3 years and put it into a larger context. Portfolio(3 years) A portfolio is a collection of programs that contribute to reaching the strategic goals and the vision of DMRI. In this case we will focus on one portfolio: - Advanced robotics The goal of the advanced robotics portfolie is to obtain the competencies that are needed to develope a new generation of moro adaptive and intelligent robots for the meat indutry. DMRI's goals, in terms of obtaining new competencies and more adaptive and intelligent automation, are visualized in the following \"road map\". Programs A program is a grouping of projects that in combination seek to achieve the goals of the program. In this case we group projects or sub-projects under four programs, where each program more or less rely on the experiences from prior programs. The project cases that constitute the activities in the programs may be continued, with an extended scope, in one of the following programs. This is especially going to be the case with the most of the projects in the first \"Analysis\" program as they naturally provide a foundation for the development of demonstrators that make use of new technologies. 1. Analysis of slaughering processes 2. \"Chip-tuned\" demonstrator 3. Novel robotic demonstrator 4. Future robotics Projects Projects have a well defined and narrow scope. At the same time, the scope might change based on feedback from customers or due to technical road blocks. Here are some of the challenges that must be overcome: - In most cases no equpment other than what is currently in use in the slaughterhouses is available. - The machines are old and documentation is non-existing. - The manufacturer may not be willing to share information. Injection into meat With meat injection an older machine is available for experimentation at DMRI. Analysis of the injection into meat project Improved spine saw or division in 3 parts or splitting Only online in slaughterhouses Robotic gripping of pork bellies from Christmas trees Focus is on teaching the robot to grip the meat robustly. Robot projects at DMRI The \"advanced robotics\" portfolio road map contains a number of programs. A program is a collection of similar tasks that may overlap several project. A project is collection of modules that solve a problem, in our case one or more processes from the slaughterhouse. [1] Analysis - [1.1] Project description and complexity classification - M[1.1.1] Candidate cases defined - M[1.1.2] Initial selection of cases - M[1.1.3] Complexity analysis completed - D[1.1.1] Report with overview of candidate cases - D[1.1.2] Report on selected cases - [1.2] Data collection - [1.2.1] RGB-D vision system - [1.2.2] Injection setup - [1.3] Data analysis - [1.3.1] Local meat type detection - [1.3.2] Local volume gain measuring [2] \"Chip-tuned\" demonstrator - [2.1] Predict control parameters - [2.2] Online learning - [2.3] Data analysis [3] Novel robotic demonstrator - [3.1] Real-time control - [3.2] Locating pork belly on Christmas trees [4] Future robotics - [4.1] Self-learning framework - [4.2] Transfer learning framework [5] Documentation and dissemination - Promotion(5 articles) - Scientific publication - Patenting - Instruction Resources MADE Focus points: - Research in adaptive learning algorithms - Adapt to variations in input - Perform corrections during processing - Learn from the quality of the produced output Main research question: How can robots learn to adapt to the natural variation exhibited in slaughter animals? Objectives: - Investigate and test self-calibrating and learning algorithms for smart factory equipment(robots) - Demonstrate and evaluate algorithms in applications found in slaughterhouses Milestones: - M1: Project scope approved(Sep. 2017) - M2: Case 1 completed(Dec. 2017) - M3: Case 2 completed(June. 2018) - M4: Final reporting(Dec. 2018) - M5: Learning points(Dec. 2018) DMRI(Sort team) Members: Mark, Haiyan, Claus, Flemming Activities: - Grouping of control challenges - Identification of technologies for solving selected cases - Qualification of the individual technologies' potential - Setup of development plan, including investigation of possibilities for securing competitive advantages through ownership of control algorithms Deliverables - Analysis of control challenges - Identification of usable technologies - Catalog of ideas Internal objectives - Min. 5 articles - Participation in min. 1 seminar or conference based on technology, work process or concrete solution - preferably with synergies with \"resultatkontrakt\" - Min. 3 financed projects derived from the work for 2017 - possibly in collaboration with \"de blå spejder\" - Collaboration with min. 3 new actors(university or other) - preferably with synergies with \"resultatkontrakt\"","tags":"projects","title":"Project management"},{"url":"cool_robots.html","text":"https://ing.dk/video/se-lille-hjaelper-robot-pa-arbejde-hos-grundfos-118751 http://www.kuka-robotics.com/denmark/da/solutions/solutions_search/L_R232_Robot_optimizes_cutting_of_pork_sides.htm https://www.scottautomation.com/meat/ https://www.youtube.com/watch?v=a3GFjKo1FPM Robot- human collaboration http://www.kuka-robotics.com/hungary/en/solutions/solutions_search/L_R280_050528_Westfleisch.htm KUKA robot faces off Timo Boll in table tennis duel Comau Racer robot how to shoot hoops","tags":"projects","title":"Cool robotics"},{"url":"interesting-reads.html","text":"Computer vision Have We Forgotten about Geometry in Computer Vision? Image Classification and Segmentation with Tensorflow and TF-Slim Inspiring projects Lego sorting with keras Kaggle traffic light detection entry Unsorted 1 https://www.nytimes.com/2015/05/22/science/robots-that-can-match-human-dexterity.html?_r=0 https://medium.com/@karpathy/alphago-in-context-c47718cb95a5 https://www.infoq.com/articles/machine-learning-techniques-predictive-maintenance?utm_source=hackernews&utm_medium=link&utm_campaign=external https://hackernoon.com/programmers-guide-to-homogeneous-coordinates-73cbfd2bcc65 reinforcement learning: https://medium.com/emergent-future/simple-reinforcement-learning-with-tensorflow-part-8-asynchronous-actor-critic-agents-a3c-c88f72a5e9f2 GANs https://hackernoon.com/how-do-gans-intuitively-work-2dda07f247a1#.jusktltwb How to do good research http://blog.robotiq.com/this-single-statement-generates-great-robotics-research http://www.sciencebuddies.org/science-fair-projects/project_engineering.shtml understanding gradient decent and momentum http://distill.pub/2017/momentum/ https://medium.com/@karpathy/yes-you-should-understand-backprop-e2f06eab496b#.elz3qb7oi http://xrds.acm.org/blog/2016/06/convolutional-neural-networks-cnns-illustrated-explanation/ https://adeshpande3.github.io/adeshpande3.github.io/A-Beginner's-Guide-To-Understanding-Convolutional-Neural-Networks/ http://cs231n.github.io/neural-networks-2/ https://blog.keras.io/how-convolutional-neural-networks-see-the-world.html http://deepdish.io/2015/02/24/network-initialization/ http://yerevann.com/a-guide-to-deep-learning/ Collection of google research: https://research.googleblog.com/2016/10/how-robots-can-acquire-new-skills-from.html http://www.bzarg.com/p/how-a-kalman-filter-works-in-pictures/ https://cs.stanford.edu/people/widom/paper-writing.html http://distill.pub/2016/misread-tsne/ Blogs: Former apple employe http://minimaxir.com/ News and research from machine learning podcast and blog https://twimlai.com/ introduction to probabilistic graphical models https://people.eecs.berkeley.edu/~jordan/prelims/ introduction to probability and statistics http://students.brown.edu/seeing-theory/ Book list: http://www.dancarlin.com/audible-book-recommendations/","tags":"research","title":"Interesting reads"},{"url":"lchf.html","text":"Sites nemlchf madbanditten Drinks varm kakao koldskål drikkeyoghurt Dinner blomkålsmos blomkålsfritter flødekartofler vikingegryde kyllinge nuggets boller-i-karry frikadeller deserts keto-cookies-creme-ice-cream Fronzen Fat Bomb Keto Ice-Cream Get Some Ice Cream chokoladekage pandekager chocolate pudding Snacks Bacon egg muffins misc mayonnaise Ketosis and LCHF resources ketosis-advantaged-or-misunderstood Important ingredients MCT Oil(XXL sport eller online) Shops bodystore Experts Dave Asprey Dr. Stephen Phinney Jeff Volek Tim Noakes David Feltman Dr. Adam Nally","tags":"news","title":"LCHF and KETO recipes"},{"url":"robots-are-coming.html","text":"P1 Morgen interviews Link til udsendelse Vil robotterne gøre os arbejdsløse? Robotterne kommer, og de kan overtage 40 procent af det arbejde, vi laver i dag, står der i en ny rapport fra Innovationsfonden. Men hvad sker der så med samfundsøkonomien? Er vi på vej mod et samfund, hvor halvdelen ikke skal arbejde? Medvirkende: Jens Hauch, cheføkonom og vicedirektør i tænketanken Kraka. 40% af vores arbejdstimer kan blive overtaget af robotter En ny rapport fra Innovationsfonden viser, at det med den teknologi vi har til rådighed i dag er det faktisk muligt at automatisere 40 procent af samtlige de arbejdstimer, der bliver lagt på det danske arbejdsmarked. Medvirkende: Lars Høngaard Andersen, direktør i Innovationsfonden. Dansk Erhverv - Vi skal ruste os til robotternes ankomst Robotterne kommer, og der kommer formentlig mange af dem i en nær fremtid. Robotter har allerede gjort deres indtog på mange produktionsvirksomheder, men meget mere er på vej. Indenfor servicesektoren kan såkaldte humanoide robotter, altså menneskelige robotter, overtage jobs inden for eksempelvis undervisning. Medvirkende: Jens Klarskov, direktør, Dansk Erhverv.","tags":"news","title":"The robots are coming"},{"url":"thesis_overview.html","text":"Abstract asd Outline asd","tags":"research","title":"PhD thesis overview"},{"url":"conference_schedule_journals.html","text":"Converting tab separated .csv file to markdown Computer Vision Abbreviation Deadline Type Category Name Description CVPR 08/11/17 Conference 2 IEEE Conference on Computer Vision and Pattern Recognition On all aspects of computer vision and pattern recognition ECCV Conference 2 European Conference on Computer Vision ICCV Conference 2 International Conference on Computer Vision VISAPP Conference International Joint Conference on Computer Vision, Imaging and Computer Graphics Theory and Applications WACV Conference 1 IEEE Winter Conference on Applications of Computer Vision Covers all areas of computer vision IPCV Conference 1 International Conference on Image Processing, Computer Vision, & Pattern Recognition AMDO Conference 1 Conference on Articulated Motion and Deformable Objects Human analysis and medicine focus ICIAR Conference 1 International Conference on Image Analysis and Recognition ISVC Conference 1 International Symposium on Visual Computing WSCG Conference Int. Conf. on Computer Graphics, Visualization and Computer Vision ACIVS Conference 1 Advanced Concepts for Intelligent Vision Systems Focus on techniques for building adaptive, intelligent, safe and secure imaging systems ACCV Conference 1 Asian Conference on Computer Vision AIPR Conference Applied Imagery Pattern Recognition IVC Journal 2 Image and Vision Computing IJCV Journal 2 International Journal of Computer Vision TPAMI Journal 2 Transactions on Pattern Analysis and Machine Intelligence CVIU Journal 2 Computer Vision and Image Understanding Machine Vision Abbreviation Deadline Type Category Name Description CVR 1 Conference on Computer and Robot Vision BMVC 1 British Machine Vision Conference MVA 1 International Conference on Machine Vision Applications ICARCV 1 International Conference on Control, Automation, Robotics and Vision ICMVA 1 International Conference on Machine Vision Applications Machine Learning Abbreviation Deadline Type Category Name Description ICML Conference 2 International Conference on Machine Learning NIPS Conference 2 Conference on Neural Information Processing Systems PAMI Conference 2 Pattern Analysis and Machine Intelligence ECMLPKDD Conference 2 European Conference on Machine Learning and Principles and Practice of Knowledge Discovery in Databases KDD Conference 2 International Conference on Knowledge Discovery and Data Mining UAI Conference 2 Uncertainty in Artificial Intelligence MLDM Conference 1 International Conference on Machine Learning and Data Mining ICLR Conference International Conference on Learning Representations focus on learning data representation, which is basically what deep learning does AISTATS Conference Artificial Intelligence and Statistics ACML Conference Asian Conference on Machine Learning AIPR Conference 1 International Conference on Artificial Intelligence and Pattern Recognition PR Journal 2 Pattern Recognition ML Journal 2 Machine Learning JMLR Journal 2 The Journal of Machine Learning Research IJITDM Journal International Journal of Information Technology and Decision Making IJPRAI Journal 1 International Journal of Pattern Recognition and Artificial Intelligence","tags":"other","title":"Conference schedule and journals"},{"url":"cutting_bellies.html","text":"Project description Pork bellies are cut and trimmed to the specification of customers. WPs Initial data collection and analysis Notes Lack of appropriate and controlled lighting It is problematic that when there is little weight on the Christmas tree, it can easily be pushed back by the gripping tool The tool needs more clearance from the robot arm What is difficult and what is easy","tags":"projects","title":"Cutting bellies"},{"url":"gripping_bellies.html","text":"Project description The standardized form of storage for bellies, hams and backs are so called Christmas trees. A Christmas tree is a steel pipe with pikes extruding in all directions. TODO list Structure and sort data :heavy_check_mark: The samples ... Visualize data :heavy_check_mark: Unsupervised segmentation/clustering Feature extraction and analysis Finding suitable gripping zone WPs Initial data collection and analysis Notes Lack of appropriate and controlled lighting It is problematic that when there is little weight on the Christmas tree, it can easily be pushed back by the gripping tool The tool needs more clearance from the robot arm What is difficult and what is easy","tags":"projects","title":"Gripping bellies"},{"url":"inject.html","text":"Adaptive brine injection Brine injection is selected as the basis for a \"quick and dirty\" project where an adaptive method will help achieve a more optimal addition of salt to meat products. The project's duration is confined to 3-4 month, this means that it is necessary to clearly deliminate the problem and make wide use of \"hand held\" solutions in order to reduce setup time and quickly test the adaptive method. The adaptiveness lies in measuring the input or the output and controlling the process parameters accordingly. Table of contents Adaptive brine injection Process description Process parameters Initial experiment State-of-the-art Meat preparation Brine injection Tumbling Machine manufacturers Process control research Possible improvements Project choices Platform Hypothesis Process description Brine is added to a wide range of meats before packaging in order to mature and tenderize the meat as well as enhance flavor. The brine consists of water and a mix of salt, phosphate, nitrate, sugar or flavoring. The central ingredient is the salt, which has the effect of increases the solubility of proteins and thereby improve the meats ability to retain water. However, if the salt concentration gets too high, the effect is reversed and the muscle fibers shrink and proteins risk getting washed out. For the best results, the brine should be uniformly distributed throughout the meat. This can be achieved by administering the brine externally or by injecting it directly into the meat. The salt will then diffuse through the meat and distribute evenly, with time, through chemical processes. Salt is able to diffuse at the most 0.5-1 cm. per day, so if the brine needs to defuse over long distances, it becomes very time intensive and impractical for modern industrial processes. The standard practice for quickly curing meat is injection of brine using a battery of needles. Even with modern injection systems the results are not always satisfactory and the meat is subjected to additional treatments. This extra treatment can happen both before and after the injection of brine. For instance, meat's ability to absorb brine can be improved by hammering before injection, this extends the muscle fibers, which increase room for brine and help achieve a more even distribution. Similarly, accelerated and improved diffusion of the injected brine along with additional absorption can be achieved by further mechanical treatment post-injection. The meat is e.g. massaged, which helps drain pockets of brine and close holes left by the injection needles. The rapport \"Accelereret saltning med multistiksprøjtning\" [2] from the DMRI project; \"Optimeret produktion af forædlede kødprodukter\" investigates the possibilities for reducing the time needed to salt products using existing equipment. The process can be helped along by treating the meat mechanically. Advanced machinery exists for both injection and mechanical treatment, but no single manufacturer provides a complete state-of-the-art solution and slaughterhouses largely rely on older outdated machinery. The goal of part of the project is to reduce the time needed for the process to under one work day(7 hours). Process parameters The process can be very complex when taking the natural variation of the meat and the process variables into account. The salting process The main process variables are: Pre-injection mechanical preparation The degree to which the muscle fibers are stretched/loosened/opened Injection pattern Denseness of injection, i.e. the spacing between injection holes Strategy for injecting brine, e.g. continuously, on the down stroke, when reaching the bottom, etc. Brine injection pressure Brine pressure through the individual needle holes depends on the flow through other holes, which maybe be blocked or completely uncovered. High pressure has proven effective at better distributing the brine. Too high pressure may result in irreparable damage to the meat, where the meat disintegrates when sliced. Injection speed/time Duration injecting brine into the meat Post-injection mechanical treatment [Time spend tumbling] Physical properties of the meat that may influence the salting: Meat texture [Hardness and viscosity tells us something about the room around muscle fibers and thereby the meats ability to absorb the brine] State of muscle fibers i.e. the degree to which the fibers are prepared to absorb the brine Size and shape Especially the height of the meat Composition Bone, skin, fat and connective tissue Muscle type Red muscle is more absorbent than white Chemical properties of the brine and meat The composition of the brine solution and the chemical properties of the meat effect the salting. The most important chemical variables are: Salt concentration Water retention increases with the concentration of salt Very high salt concentrations reverses the effect Type of salt NaCl is significantly better than KCl at increasing water retention Sugar concentration Sugar has a similar effect to salt Phosphate concentration Phosphate increases the pH and water retention pH pH decides which ion, Na+ or Cl- , plays the primary role in increasing water retention A pH value around 6 has shown to lead to optimal water retention when using NaCl Temperature Low temperature contributes to better water retention, 4° being optimal High temperature speeds up the diffusion of salt through the meat Type of meat Amount of protein and the ratios between protein types, e.g. intracellular(soluble) and extracellular(non-soluble), has an effect on the meats ability to retain water pH difference between cuts , e.g. pork shoulder has a much higher pH than pork loin Initial experiment An initial experiment was conducted in order to investigate the effect of the two primary process parameters; brine pressure and injection speed, as well as determine the possibilities for visually measuring the gain using 3D sensing. The details of the experiment are described in multistiksprøjte eksperiment . State-of-the-art Examples of some of the most advanced machines and research. Meat preparation The effectiveness of mechanical preparation of meat is not yet well documented or understood. Some of the leading products for mechanical preparation of meat before injection of brine are: STEAKER/PRESSES by Günther (DE) These machines enlarges the surface area of meat cutting or pressing the meat. MAX by Schröder (DE) Massages the meat in a temperature controlled environment, with or without vacuum. TwinHammer 5500 by METALQUIMIA Pre-massaging unit that stretch the muscle fibers, which increase the space around fibrils. Leads to a reduction in the time needed for tumbling after injection. twinhammer Bladehammer 5500 by METALQUIMIA bladehammer Brine injection In the meat industry, brine is most commonly added using machines with multiple injection needles, the number of needles typically ranges from 40 to 500 with a spacing of 12-25 mm. With the trend going towards many thin needles with a high number of small holes combined with high pressure. Correct adjustment of the injector has a large impact on the time needed for the salt to properly diffuse. [3] IMAX 420 by Schröder (DE): Schröder offers integrated weights that automatically control and adapt the injection speed during operation. They also offer individual needle damage and flow detection. Their injection system rely on many and very thin needles as well as independent control of conveyor belt, which allows for a very dense injection pattern IMAX 420 PI 750 DUO by Günther (DE) Spray Plus Traditionally, brine is injected using needles with a few holes that has a diameter above 1 mm and a low brine pressure of a few bars. With the spray plus system, Günther introduces a spray system where the needles have many holes with a small diameter and a very high brine pressure. This results in very fine droplets that should distribute well in the meat. Because of the much improved distribution of brine, the drip loss is reduced significantly. The classical low pressure injection technique: (1) Brine injection from the start, (2) Spraying continous as the needles descend, (3) Needles reach the bottom and leaves pockets of brine, (4) As the needles are withdrawn, brine collects in the holes (5) As the needles leave the meat, brine will escape The new high pressure injection technique: (1) Needles enters the meat without spraying brine, (2) needles continue al the way to the bottom without spraying, (3) Brine is spayed using high pressure from all holes, (4) Needles are withdrawn without spraying brine The efficacy of the technology has not been verified independently yet PI 750 DUO M3 by FOMACO (DK) Inline Weight Controller (IWC) constantly monitors the injection quantity and corrects the settings in case of irregularities. M3 Movistick Plus 5500 by METALQUIMIA Movistick Plus 5500 MOVIPLUS 4.0 by METALQUIMIA MOVIPLUS 4.0 Up & Down system for regulating the depth the needles will penetrate in order to avoid injecting fat and skin Tumbling The diffusion of salt is helped along by the use of mechanical tumbling, which quickly can distribute the salt up to 2 cm. [3] The meat is gently tumbled, resulting in a massage of the meat that helps drain unabsorbed brine and thereby avoiding pockets of brine as well as closing up the holes that are left from the injection. DRYBINDER by METALQUIMIA (ES) DRIPPING TUNNEL by Metalbud Nowicki (PL) Machine manufacturers Name Country Pre-injection Injection Post-injection Link Metalbud Nowicki Poland :heavy_check_mark: :heavy_check_mark: :heavy_check_mark: homepage METALQUIMIA Spain :heavy_check_mark: :heavy_check_mark: :heavy_check_mark: homepage Marel Island :heavy_check_mark: homepage GAROS Sweden :heavy_check_mark: :heavy_check_mark: homepage FOMACO Denmark :heavy_check_mark: homepage Günther Germany :heavy_check_mark: :heavy_check_mark: :heavy_check_mark: homepage Schröder Germany :heavy_check_mark: :heavy_check_mark: :heavy_check_mark: homepage Process control research (Determination of Optimal Process Parameters to Prepare Licorice Extract Micro-particles Using Artificial Neural Network Based Particle Swarm Optimization)[https://github.com/markpp/Paper-notes/blob/master/process%20control/zhang2016determination.md] resume(ongoing) (Hybrid fuzzy logic and pid controller based ph neutralization pilot plant)[https://github.com/markpp/Paper-notes/blob/master/process%20control/naseer2013hybrid.md] resume(ongoing) (Learning to learn by gradient descent by gradient descent)[https://arxiv.org/abs/1606.04474] Possible improvements Here is a list of features that has the potential to improve the process, quality and knowledge of the product in general. Some of the features already exist in machines currently on the market. Process Increased injection cadence could lead to high throughput Flexible injector that is easily integrated on the production line Injection of in-bone meat Reducing the number of steps/machines required to achieve the same result Individualized robotic pre-massaging Quality Adjustable injection depth Flow monitoring Finer injection patterns without needing more and tighter packed needles Advanced injection strategies Avoiding areas with bone or non muscle tissue Avoid reaching extreme local concentrations of salt Adapt injection to individual and local variation Optimal injection wrt. to fiber orientation Optimal injection wrt. muscle type Knowledge Does the hardness of meat tell something about the ability to absorb brine? Composition and tenderness of the meat can be used to grade and sort the product What is there an optimal amount of brine pressure? Project choices To move forward with the project it is necessary to decide on a limited number of ideas to proceed with and perform initial experimentation that can help determine their potential. Predicting brine absorption Possible techniques for determining meat properties that correlate with the ability to absorb brine and which, therefore can be used to predicting optimal process parameters for the individual pieces of meat and local areas as well. - Visual detection of red and white muscles - Haptic measurement of muscle firmness - Weight and size Process optimization Ideas for adjusting the process between product types, individual pieces of meat and even locally. - Adjust injection pattern - Injection strategy - Injection pressure - Injection speed(time) Measuring quality of salting In order to evaluate the prospective system and as feedback to the optimization method, it is necessary to find an appropriate and effective technique for determining the quality of the salting. The techniques are grouped in real-time appropriate and delayed techniques. The real-time methods are preferred because they can be automated and can provide direct feedback to a potential control loop. The delayed techniques are time consuming and are only appropriate for system calibration and evaluation. Real-time Ultrasound image Injection of salt-meter electrodes to sample salinity Local increase in weight/volume Measure firmness -> texture [4] Delayed CT scanning, use contrast fluid if necessary Slice and photograph, use contrast fluid if necessary Drip loss/non-absorbed brine (External color change) Measuring salt content: Salt in brine and Salt in meat Platform There are two platforms that the project could potentially be based on. The first, is the type of dedicated machine that is currently used in the production out in the slaughterhouses. The alternative is mounting needles on a industrial robot arm, which at least initially is thought of as an experimentation platform. Dedicated injector Industrial multi-injectors have roughly looked the same for half a century. A large box build around a conveyor belt with rows of injection needles that are raised up and down while the conveyor belts moves the meat forward. An example, although very old, is available to be used and modified for this project. Depending on the ambition of the project, the machine needs to under extensive reconstruction. \"Chip-tuning\" of existing multi-injection machine The use of an industrial dedicated multi-injection machine has a number of potential benefits and disadvantages: Pros Proven Availability Cons Not easily modified Some special features of this type of solution could be: - Automation of process parameters using feedback from weighing before and after injection - Automatic switching between recipes based on detection of meat type - Adjustment of injection parameters across meat piece according to each end's ability to absorb brine Robot cell injector The use of an industrial robot for injection has a number of potential benefits and disadvantages: Pros Adaptability to product variation, e.g. size, bone-in Smaller footprint -> more freedom in placement Multipurpose -> high utilization, redundancy Cons Unproven Lower throughput(maybe) New needle tool necessary Some special features of this type of solution could be: - Local injection of brine followed by weighing in order to determine local gain - Highly customized injection patterns - High flexibility in application - Automatic needle cleaning and switching Plan T3 and T4 could be entirely handheld at first. Tasks: T1: Input sensing system Based on measurements of the input we need to predict the amount of brine to inject in local areas. The prediction will be based on image features in an RGB image. In addition a 3D profile of the input is needed in order to control where to inject with the injection tool mounted on the robot arm. Finally, a scanning of the internal structure of the meat will enable us to avoid areas of fat and bone, which should not be injected. Features in prioritized order: - Prediction of brine absorption based on RGB - 3D scanning for injection control - Scanning of internal structure using CT or ultrasound T2: Output sensing system Measurements of the output is need in order to determine the quality of the injection. The most basic measure for determining this is the drip loss rate. A potential improvement would be localized measurement of the increase in volume or a scanning that reveals the internal brine distribution. Features in prioritized order: - Weighing at several points in time after injection for determining drip loss rate - 3D scanning before and after for determining local volume increase - Scanning of internal brine distribution T3: Robot arm controller Features in prioritized order: - Simple uniform injection pattern T4: Injection tool Hypothesis First of all, the purpose of the project is to achieve an equal or better distribution of salt in less time than with conventional equipment. Below are a handful of hypothesis for how to achieve this goal: By letting a learning algorithm explore injection strategies it is possible to achieve a faster and more uniformly distributed salting. It is possible to identify the individual meat piece's ability to absorb brine and adapt the injection parameters accordingly The same but for local areas of the same piece of meat Is it possible to measure to gain visually with a significant precision(what should this be?) The same but for local areas of the same piece of meat What are the optimal process parameters for each type of meat Grid search for investigating interactions between parameters Classifier learns the correlation and predicts result Is it possible to predict the optimal process parameters for the individual pieces of meat The same but for local areas of the same piece of meat Is it possible to find features that allow for to capture the variation in individual pieces of meats? Is it possible to distinguish between red and white meat fibers visually? Process optimization Optimal preparation of meat for uniform salt distribution Optimal injection for uniform salt distribution Optimal post injection processing Example diagram of PID control of process parameters [1]: DMRI report 2014: Optimeret produktion af forædlede kødprodukter, Tomas Jacobsen [2]: DMRI report 2017: Optimeret produktion af forædlede kødprodukter - Accelereret saltning med multistiksprøjtning, Mikael Bülow Pedersen [3]: Bøgh-Sørensen, L. & Zeuthen, P. (2002) Konserveringsteknik bind 2, 2. udgave. DSR Forlag. [4]: Japaneese meal test link","tags":"projects","title":"Injection"},{"url":"research-areas.html","text":"Reinforcement learning Appropriate actions in a given state are learned from feedback in the form of rewards and penalties. Exploration and exploitation are the mechanisms for trying new actions and for xx, respectively. - Self-learning framework which can be applied to several similar robot control problems. DeepMind, Playing Atari with Deep Reinforcement Learning DeepMind, Human-level control through deep reinforcement learning Continuous(online) learning Continuously adjusting a trained model while in use, based on feedback. Extending a pre-trained model with new functionality, e.g. adding an additional class to a classifier without retraining using the original dataset. Hybrid intelligence Many of the tasks that must be automated are too challenging for current machine intelligence to consistently solve at a satisfactory level of performance. Hybrid intelligence where human intelligence is kept in the loop is thus a necessity for the foreseeable future. When applying hybrid intelligence there exists two interaction patterns; active learning and hybrid interaction. In the former, human intelligence is only utilized when the machine isn't confident. In the latter both machine and human intelligence is involved in every case. Here the machine propose a solution that the human must accept, modify or reject. Hybrid Intelligence: How Artificial Assistants Work Transfer learning Taking a model trained for one task and fine-tuning it for use in a related task.","tags":"research","title":"Research areas"},{"url":"summer_schools.html","text":"Converting tab separated .csv file to markdown Summer Schools Name Description Deadline Date Location Vision and Sports Summer School Combines lectures in CV with sports activities 12/05/17 21/08/17-26/08/17 Czech Technical University, Prague BMVA Computer Vision Summer School Lincoln UK ICVSS International Computer Vision Summer School Sicily EECVC Eastern European Conference on Computer Vision 1 day with lectures and networking 14/07/17 14/07/17 Odessa, Ukraine DLSS Deep Learning Summer School 26/06/17 - 01/07/17 Montreal, Canada RLSS Reinforcement Learning Summer School 03/07/17 - 05/07/17 Montreal, Canada International Summer School on Deep Learning 19/05/17 17/07/17 - 21/07/17 Bilbao, Spain","tags":"other","title":"Relevant summer schools"}]}